	ID		DIVISION.
	PROGRAM-ID.	'WORK-IIII'.

	ENVIRONMENT	DIVISION.
	CONFIGURATION	SECTION.
	INPUT-OUTPUT	SECTION.
	FILE-CONTROL.
		SELECT SALE-FILE ASSIGN TO RANDOM 'SALES.DAT'
			ORGANIZATION IS LINE SEQUENTIAL.
		SELECT OUT-FILE ASSIGN TO RANDOM 'OUT.OUT'
			ORGANIZATION IS LINE SEQUENTIAL.
	DATA	DIVISION.
	FILE	SECTION.
	FD	SALE-FILE.
	01 SALE-RECORD.
	   11 SALE-DATE.
	      21 SALE-YEAR	PIC 9(2).
	      21 SALE-MONTH	PIC 9(2).
	      21 SALE-DAY	PIC 9(2).
	   11  SALE-NO		PIC X(3).
	   11 PRO-NO		PIC 9(4).
	   11 PRO-PRICE		PIC 9(4).
	   11 PRO-QTY		PIC 9(4).
	   11 SALESMAN		PIC 9(4).
	FD	OUT-FILE.
	01 FILE-RECORD		PIC X(60).
	WORKING-STORAGE	SECTION.
	01 WORK-AREA.
	   05 EOF		PIC 9 VALUE 0.
	   05 CHECK-YEAR	PIC 9(2).
	   05 CHECK-MONTH	PIC 9(2).
	   05 CHECK-DAY		PIC 9(2).
	   05 TOTAL-MONTH	PIC 9(6).
	   05 TOTAL-DAY		PIC 9(6).
	   05 TOTAL-ALL		PIC 9(6).
	   
	01 OUT-RECORD.
	   02 FILLER	PIC X(6) VALUE SPACE.
	   02 OUT-DATE.
	      03 OUT-YEAR	PIC 9(2)/.
	      03 OUT-MONTH	PIC 9(2)/.
	      03 OUT-DAY	PIC 9(2).
	   02 FILLER	PIC X(6) VALUE SPACE.
	   02 OUT-NO	PIC 9(4).
	   02 FILLER	PIC X(10).
	   02 OUT-QTY	PIC 9(6).
	   02 FILLER	PIC X(20).

	01 HEAD-1.
	   15 FILLER	PIC X(23) VALUE SPACE.
	   15 FILLER	PIC X(14) VALUE '北　青　公　司'.
	   15 FILLER	PIC X(13) VALUE SPACE.
	01 HEAD-2.
	   15 FILLER	PIC X(23) VALUE SPACE.
	   15 FILLER	PIC X(14) VALUE '銷　售　報　表'.
	   15 FILLER	PIC X(23) VALUE SPACE.
	01 HEAD-3.
	   15 FILLER	PIC X(6) VALUE SPACE.
	   15 FILLER	PIC X(8) VALUE '銷售日期'.
	   15 FILLER	PIC X(6) VALUE SPACE.
	   15 FILLER	PIC X(8) VALUE '產品編表'.
	   15 FILLER	PIC X(6) VALUE SPACE.
	   15 FILLER	PIC X(8) VALUE '銷售數量'.
	   15 FILLER	PIC X(6) VALUE SPACE.
	   15 FILLER	PIC X(4) VALUE '備註'.
	   15 FILLER	PIC X(8) VALUE SPACE.
	01 HEAD-4.
	   15 FILLER	PIC X(60) VALUE ALL '='.
	01 M-TOTAL-LINE.
	   15 FILLER	PIC X(6) VALUE SPACE.
	   15 M-YEAR	PIC 9(2)/.
	   15 M-MONTH	PIC 9(2).
	   15 FILLER	PIC X(6) VALUE SPACE.
	   15 FILLER	PIC X(14) VALUE '  月銷售數量'.
	   15 FILLER	PIC X(3) VALUE SPACE.
	   15 M-TOTAL	PIC 9(6).
	   15 FILLER	PIC X(2) VALUE '**'.
	01 TOTAL-LINE.
	   15 FILLER	PIC X(19).
	   15 FILLER	PIC X(10) VALUE '總銷售數量'.
	   15 FILLER	PIC X(5) VALUE SPACE.
	   15 TOTAL-A	PIC 9(6).
	PROCEDURE	DIVISION.
	0000-RTN.
	    OPEN INPUT  SALE-FILE
		 OUTPUT OUT-FILE.
	    PERFORM HEADING-RTN.
	    PERFORM 0001-RTN.
	    PERFORM 0002-RTN UNTIL EOF = 1.
	    PERFORM SUM-RTN.
	    PERFORM FOOTING-RTN.
	    CLOSE SALE-FILE OUT-FILE.
	    STOP RUN.
	0001-RTN.
	    READ SALE-FILE AT END MOVE 1 TO EOF.
	    MOVE SALE-YEAR  TO CHECK-YEAR.
	    MOVE SALE-MONTH TO CHECK-MONTH.
	    MOVE SALE-DAY   TO CHECK-DAY.
	0002-RTN.
	    IF SALE-MONTH NOT = CHECK-MONTH
		PERFORM SUM-RTN.
	    MOVE SALE-YEAR TO OUT-YEAR.
	    MOVE SALE-MONTH TO OUT-MONTH.
	    MOVE SALE-DAY TO OUT-DAY.
	    MOVE PRO-NO	TO OUT-NO.
	    MOVE PRO-QTY TO OUT-QTY.
	    ADD OUT-QTY TO TOTAL-MONTH.
	    ADD OUT-QTY TO TOTAL-ALL.
	    WRITE FILE-RECORD FROM OUT-RECORD.
	    READ SALE-FILE AT END MOVE 1 TO EOF.
	HEADING-RTN.
	    WRITE FILE-RECORD FROM SPACE.
	    WRITE FILE-RECORD FROM HEAD-1.
	    WRITE FILE-RECORD FROM SPACE.
	    WRITE FILE-RECORD FROM HEAD-2.
	    WRITE FILE-RECORD FROM SPACE.
	    WRITE FILE-RECORD FROM HEAD-3.
	    WRITE FILE-RECORD FROM HEAD-4.
	SUM-RTN.
	    MOVE CHECK-YEAR TO M-YEAR.
	    MOVE CHECK-MONTH TO M-MONTH.
	    MOVE TOTAL-MONTH TO M-TOTAL.
	    WRITE FILE-RECORD FROM M-TOTAL-LINE.
	    MOVE SALE-MONTH TO CHECK-MONTH.
	    MOVE SALE-DAY   TO CHECK-DAY.
	    MOVE ZERO TO TOTAL-MONTH.
	FOOTING-RTN.
	    MOVE TOTAL-ALL TO TOTAL-A.
	    WRITE FILE-RECORD FROM TOTAL-LINE.
	    WRITE FILE-RECORD FROM HEAD-4.