	ID		DIVISION.
	PROGRAM-ID.	'WORK-I'.

	ENVIRONMENT	DIVISION.
	CONFIGURATION	SECTION.
	INPUT-OUTPUT	SECTION.
	FILE-CONTROL.
	    SELECT FILE-RECORD ASSIGN TO RANDOM 'STOCK.DAT'
		ORGANIZATION IS LINE SEQUENTIAL.
	    SELECT REPORT-RECORD ASSIGN TO RANDOM 'W.OUT'
		ORGANIZATION IS LINE SEQUENTIAL.
	DATA		DIVISION.
	FILE		SECTION.
	FD FILE-RECORD
	    LABEL RECORD STANDARD.
	01 INPUT-RECORD.
	    02 IN-NO	PIC X(4).
	    02 IN-NM	PIC X(8).
	    02 IN-UN	PIC X(2).
	    02 IN-COST	PIC 9(3).
	    02 IN-PRICE	PIC 9(3).
	    02 IN-QTY	PIC 9(3).
	    02 IN-DATE.
	       03 IN-YEAR	PIC 9(2).
	       03 IN-MONTH	PIC 9(2).
	       03 IN-DAY	PIC 9(2).
	    02 IN-SAFE	PIC 9(3).
	FD REPORT-RECORD
	    LABEL RECORD STANDARD.
	01 OUTPUT-RECORD PIC X(80).

	WORKING-STORAGE	SECTION.
	77 EOF		PIC 9 VALUE 0.
	01 OUTPUT-LIST.
	    02 OUT-NO	PIC X(4).
	    02 FILLER	PIC X(4) VALUE SPACE.
	    02 OUT-NM	PIC X(8).
	    02 FILLER	PIC X(4) VALUE SPACE.
	    02 QTY-R.
	       03 OUT-QTY   PIC 9(3).
	       03 OUT-UN    PIC X(2).
	    02 FILLER	PIC X(4) VALUE SPACE.
	    02 COST-R.
	       03 OUT-COST  PIC 9(3).
	       03 FILLER    PIC X(3) VALUE 'д╕/'.
	       03 OUT-UN-2  PIC X(2).
	    02 FILLER	PIC X(4) VALUE SPACE.
	    02 YEAR-R.
	       03 OUT-YEAR	PIC 9(2).
	       03 FILLER	PIC X(2) VALUE 'ж~'.
	    02 FILLER	PIC X(4) VALUE SPACE.
	    02 MONTH-R.
	       03 OUT-MONTH	PIC 9(2).
	       03 FILLER	PIC X(2) VALUE 'ды'.

	PROCEDURE DIVISION.
	0000-RTN.
	    OPEN INPUT FILE-RECORD
	    	 OUTPUT REPORT-RECORD.
	    READ FILE-RECORD AT END MOVE 1 TO EOF.
	    PERFORM 0001-RTN UNTIL EOF = 1.
	    CLOSE FILE-RECORD REPORT-RECORD.
	    STOP RUN.

	0001-RTN.
	    MOVE IN-NO TO OUT-NO
	    MOVE IN-NM TO OUT-NM
	    MOVE IN-QTY TO OUT-QTY
	    MOVE IN-UN TO OUT-UN
	    MOVE IN-COST TO OUT-COST
	    MOVE IN-UN TO OUT-UN-2
	    MOVE IN-YEAR TO OUT-YEAR
	    MOVE IN-MONTH TO OUT-MONTH
	    WRITE OUTPUT-RECORD FROM OUTPUT-LIST
	    READ FILE-RECORD AT END MOVE 1 TO EOF.