	ID		DIVISION.
	PROGRAM-ID.	'WORK-III'.

	ENVIRONMENT	DIVISION.
	CONFIGURATION	SECTION.
	INPUT-OUTPUT	SECTION.
	FILE-CONTROL.
	    SELECT A-CLASS-F ASSIGN TO RANDOM 'CLASS-A.DAT'
		ORGANIZATION IS LINE SEQUENTIAL.
	    SELECT B-CLASS-F ASSIGN TO RANDOM 'CLASS-B.DAT'
		ORGANIZATION IS LINE SEQUENTIAL.
	    SELECT NEW-F ASSIGN TO RANDOM 'CLASS-F.OUT'
		ORGANIZATION IS LINE SEQUENTIAL.

	DATA	DIVISION.
	FILE	SECTION.
	FD A-CLASS-F.
	01 CLASS-A.
	   02 REG-NO-A	PIC 9(6).
	   02 FILLER	PIC X(25).
	FD B-CLASS-F.
	01 CLASS-B.
	   02 REG-NO-B	PIC 9(6).
	   02 FILLER	PIC X(25).
	FD NEW-F.
	01 NEW-REC	PIC X(31).

	WORKING-STORAGE	SECTION.
	77 A-EOF	PIC 9.
	77 B-EOF	PIC 9.

	PROCEDURE DIVISION.
	0000-RTN.
	    OPEN INPUT A-CLASS-F B-CLASS-F
		 OUTPUT NEW-F.
	    READ A-CLASS-F AT END MOVE 1 TO A-EOF.
	    READ B-CLASS-F AT END MOVE 1 TO B-EOF.
	    PERFORM 0001-RTN UNTIL A-EOF = 1 AND B-EOF = 1.
	    CLOSE A-CLASS-F B-CLASS-F NEW-F.
	    STOP RUN.
	0001-RTN.
	    IF REG-NO-A < REG-NO-B
		WRITE NEW-REC FROM CLASS-A
		PERFORM CLASS-A-RTN
	    ELSE IF REG-NO-A > REG-NO-B
		WRITE NEW-REC FROM CLASS-B
		PERFORM CLASS-B-RTN.
	CLASS-A-RTN.
	    READ A-CLASS-F AT END MOVE 999999 TO REG-NO-A
				  MOVE 1 TO A-EOF.
	CLASS-B-RTN.
	    READ B-CLASS-F AT END MOVE 999999 TO REG-NO-B
				  MOVE 1 TO B-EOF.
