	ID		DIVISION.
	PROGRAM-ID.	'WORK-II'.

	ENVIRONMENT	DIVISION.
	CONFIGURATION	SECTION.
	INPUT-OUTPUT	SECTION.
	FILE-CONTROL.
	    SELECT FILE-RECORD ASSIGN TO RANDOM "A.DAT"
		ORGANIZATION IS LINE SEQUENTIAL.
	    SELECT I-REPORT ASSIGN TO RANDOM 'I.OUT'
		ORGANIZATION IS LINE SEQUENTIAL.
	    SELECT J-REPORT ASSIGN TO RANDOM 'J.OUT'
		ORGANIZATION IS LINE SEQUENTIAL.
	    SELECT K-REPORT ASSIGN TO RANDOM 'K.OUT'
		ORGANIZATION IS LINE SEQUENTIAL.
	DATA		DIVISION.	
	FILE		SECTION.
	FD FILE-RECORD
	    LABEL RECORD IS STANDARD.
	01 STU-REC.
	   03 IN-NO		PIC 9(3).
	   03 IN-NM		PIC X(5).
	   03 IN-CHI		PIC 9(3).
	      88 CHI-A		VALUE 80 THRU 100.
	   03 IN-ENG		PIC 9(3).
	      88 ENG-A		VALUE 80 THRU 100.
	FD I-REPORT
	    LABEL RECORD IS STANDARD.
	01 I-REC		PIC X(30).
	FD J-REPORT
	    LABEL RECORD IS STANDARD.
	01 J-REC		PIC X(30).
	FD K-REPORT
	    LABEL RECORD IS STANDARD.
	01 K-REC		PIC X(30).

	WORKING-STORAGE SECTION.
	01 EOF			PIC 9 VALUE 0.
	01 SUM-A		PIC 9(3).
	01 I-OUT.
	   03 I-NO		PIC 9(3).
	   03 FILLER		PIC X VALUE SPACE.
	   03 I-NM		PIC X(5).
	   03 FILLER		PIC X(2) VALUE SPACE.
	   03 I-SUM		PIC 9(3).
	      88 SUMA		VALUE 160 THRU 200.
	   03 FILLER		PIC X(2) VALUE SPACE.
	   03 I-CHI		PIC 9(3).
	   03 FILLER		PIC X(2) VALUE SPACE.
	   03 I-ENG		PIC 9(3).
	      88 ENGA		VALUE 80 THRU 100.
	   03 FILLER		PIC X(2) VALUE SPACE.
	   03 I-MARK		PIC X.
	01 K-OUT.
	   03 K-NM		PIC X(5).
	   03 FILLER		PIC X VALUE SPACE.
	   03 K-ENG		PIC 9(3).
	PROCEDURE DIVISION.
	0000-RTN.
	    OPEN INPUT  FILE-RECORD
		 OUTPUT I-REPORT J-REPORT K-REPORT.
	    READ FILE-RECORD AT END MOVE 1 TO EOF.
	    PERFORM 0001-RTN UNTIL EOF = 1.
	    CLOSE FILE-RECORD I-REPORT J-REPORT K-REPORT.
	    STOP RUN.
	0001-RTN.
	    MOVE IN-NO TO I-NO.
	    MOVE IN-NM TO I-NM.
	    COMPUTE SUM-A = IN-CHI + IN-ENG.
	    MOVE SUM-A TO I-SUM.
	    MOVE IN-CHI TO I-CHI.
	    MOVE IN-ENG TO I-ENG.
	    IF CHI-A AND ENG-A
	    MOVE 'A' TO I-MARK
	    END-IF.
	    IF NOT CHI-A AND NOT ENG-A
	    MOVE 'B' TO I-MARK
	    END-IF.
	    WRITE I-REC FROM I-OUT.

	    IF SUMA
	    WRITE J-REC FROM I-OUT
	    END-IF.

	    IF ENGA
	    MOVE I-NM TO K-NM
	    MOVE I-ENG TO K-ENG
	    WRITE K-REC FROM K-OUT
	    END-IF.
	    READ FILE-RECORD AT END MOVE 1 TO EOF.