	ID		DIVISION.
	PROGRAM-ID.	'9456043'.

	ENVIRONMENT	DIVISION.
	CONFIGURATION	SECTION.
	
	DATA		DIVISION.
	WORKING-STORAGE	SECTION.
	77 I		PIC 9.
	77 J		PIC 9.
	77 ANS		PIC X.
	77 SALARY	PIC $$$,$$$.
	01 TABLE1.
	    05 FILLER	PIC X(25) VALUE '0600007000080000900010000'.
	    05 FILLER	PIC X(25) VALUE '0700008000090001000011000'.
	    05 FILLER	PIC X(25) VALUE '0800009000100001100012000'.
	    05 FILLER	PIC X(25) VALUE '1000012000140001600018000'.
	    05 FILLER	PIC X(25) VALUE '1200014000160001800020000'.
	    05 FILLER	PIC X(25) VALUE '1400016000180002000022000'.
	    05 FILLER	PIC X(25) VALUE '1600019000220002500028000'.
	01 TABLE2  REDEFINES  TABLE1.
	    05 AA OCCURS 7 TIMES.
		10 MONTH-SALARY OCCURS 5 TIMES PIC 9(5).

	PROCEDURE	DIVISION.
	0000-RTN.
	    DISPLAY 'JOB HEIGHT:' LINE 5 POSITION 10 ERASE.
	    DISPLAY 'JOB LEVEL:' LINE 7 POSITION 10.
	    DISPLAY 'MONTHS SALARY:' LINE 9 POSITION 10.
	0001-RTN.
	    ACCEPT I LINE 5 POSITION 30 NO BEEP.
	    IF I = 0 OR I > 7 DISPLAY 'ERROR' LINE 15 POSITION 10
	        PERFORM 0001-RTN.
	0002-RTN.
	    ACCEPT J LINE 7 POSITION 30 NO BEEP.
	    IF J = 0 OR J > 5 DISPLAY 'ERROR' LINE 15 POSITION 10
	        GO TO 0002-RTN.
	    MOVE MONTH-SALARY(I , J) TO SALARY.
	    DISPLAY SALARY LINE 9 POSITION 30.
	0003-RTN.
	    DISPLAY 'CONTINUE?(Y/N)' LINE 11 POSITION 30.
	    ACCEPT ANS LINE 11 POSITION 45 NO BEEP.
	    IF ANS = 'Y'
	        GO TO 0000-RTN
	    ELSE IF ANS = 'N'
	        STOP RUN
	    ELSE
	    	DISPLAY 'ERROR' LINE 15 POSITION 10
		PERFORM 0003-RTN
	    END-IF.